[
    {
        "id": "muhurtha-kaal-undruthal",
        "title": "Muhurtha Kaal Undruthal",
        "date": "Friday, Nov 22",
        "description": "Start of the Wedding Rituals",
        "content": "Four to five days before the wedding, both the bride and groom’s families conduct the first pooja that officially starts off the wedding rituals. The top of a bamboo cane is decorated with mango leaves. The priest performs puja, and the bride and groom's close relatives apply manjal (turmeric) and kungumam (vermilion) at five different spots on the cane. It is tied up at the entrance of the house and is referred to as 'Muhurtha kaal.' This notifies those in the neighborhood that a marriage will take place at this house."
    },
    {
        "id": "kalyanam-soluthal",
        "title": "Kalyanam Soluthal",
        "date": "Saturday, Nov 23",
        "description": "Proclamation of Marriage",
        "content": "Following Muhurtha Kaal Undruthal, the immediate family of the bride and groom formally invite the grandparents, aunts, and uncles to the wedding."
    },
    {
        "id": "kumbuduthal",
        "title": "Kumbuduthal",
        "date": "Tuesday, Nov 26",
        "description": "Offering to God and Ancestors",
        "content": "It is customary to start by praying to God and ancestors before any good event. One or two days before the wedding, the family pray that the upcoming marriage should go well without any hindrance and that the bride and groom be blessed for life and be bestowed with the 16 virtues: kalvi (education), arivu (knowledge), aayul (longevity), aatral (dexterity), ilamai (youth), thunivu (valor), perumai (respect), pon (gold), porul (wealth), pugal (fame), nilam (land), nanmakkal (good progeny), nalloolukam (good surrounding), noyinami (good health), muyarchi (perserverance), vetri (success)."
    },
    {
        "id": "kudi-aaki-unuthal",
        "title": "Kudi Aaki Unuthal",
        "date": "Tuesday, Nov 26",
        "description": "Gathering",
        "content": "Two days before the wedding, the extended family starts gathering at the wedding house and formal feast festivities kick off."
    },
    {
        "id": "manai-poduthal",
        "title": "Manai Poduthal",
        "date": "Tuesday, Nov 26",
        "content": "One or two days before the wedding, married women of the bride’s family build the Manai. The Manai is the platform on which the wedding ceremony, including the tying of the knot, will be conducted. The Manai is constructed from bricks and red clay brought from the native village pond. It’s then decorated with sandalwood, saffron, and flowers. Throughout the building ceremony, a sacred conch is blown."
    },
    {
        "id": "matru-kattuthal",
        "title": "Matru Kattuthal",
        "date": "Tuesday, Nov 26",
        "content": "During Manai Poduthal, the residence’s designated laundry worker will bring a change of saree which they tie over the manai. Back in the day, this was done to prevent any insects or lizards from dropping on the bride and groom during the wedding ceremony. "
    },
    {
        "id": "mulaipaari-poduthal",
        "title": "Mulaipaari Poduthal",
        "date": "Wednesday, Nov 27",
        "description": "Sprouting",
        "content": "Three days before the wedding, the groom’s family soak navadaniyam (nine variety of seeds) and let it sprout. This symbolizes that the newly married couple should sprout and multiply and live. Building a fort: The groom’s family also build a straw stack symbolizing a fort. This haystack is then brought to the ceremony on the wedding day. After tying the knot, the newly married couple will step over the haystack."
    },
    {
        "id": "thumbu-pidithal",
        "title": "Thumbu Pidithal",
        "date": "Wednesday, Nov 27",
        "description": "Invoking Divine Presence",
        "content": "The day before the wedding, two married women draw a temple pattern on the wall using thread and rice batter. This ceremony is known as Thumbu Pidithal and represents inviting the presence of God."
    },
    {
        "id": "aarasanikal-naduthal",
        "title": "Aarasanikal Naduthal",
        "date": "Wednesday, Nov 27",
        "description": "Planting of the King's Flag",
        "content": "Back in the day, all weddings were facilitated by the king. Over the course of time, as the king could no longer personally be there, the Aarasanikal (flag stand) and flag made of branches are placed to represent his presence. "
    },
    {
        "id": "kaluthiru-vankuthal",
        "title": "Kaluthiru Vankuthal and Korthal",
        "date": "Wednesday, Nov 27",
        "description": "Collecting and Stringing the Kaluthiru",
        "content": "The day before the wedding, members of the groom’s family arrive at the bride’s house to collect the Kaluthiru. Kaluthiru is a unique piece of jewelry, exclusive to the Chettiar community. It is made of 31 pieces of gold strung on 10 strands of turmeric-coated thread. After collecting the pieces, the groom’s family will string the Kaluthiru in preparation for the wedding ceremony. The groom will tie the Kaluthiru on the bride to tie the knot."
    },
    {
        "id": "puram-kalithal",
        "title": "Puram Kalithal",
        "date": "Thursday, Nov 28, Early morning",
        "description": "Protection Ritual",
        "content": "In the early morning of the wedding, the bride’s paternal aunt places neem leaves on her to ward off evil spirits."
    },
    {
        "id": "paun-thatuthal",
        "title": "Paun Thatuthal",
        "date": "Thursday, Nov 28, Morning",
        "description": "Gold Sovereign Coin Tapping",
        "content": "On the morning of the wedding, the groom’s family bring a gold sovereign coin and tap it. This symbolizes the making of the kaluthiru."
    },
    {
        "id": "poo-manum-eduthal",
        "title": "Poo Manum Eduthal",
        "date": "Thursday, Nov 28, Morning",
        "description": "Flower Showering",
        "content": "On the morning of the wedding, the bride is seated on the manai and blessed by men of the bride's family by placing flowers on her knees, wrists, and shoulders. A red cloth is also tied around the wrist. Later, once the groom has arrived, the same ritual is done for the groom - here it is called Bhagavadyanam Seythal. Bhagavadyana is worshiping God for the success of married life."
    },
    {
        "id": "mappillai-azhaippu",
        "title": "Mappillai Azhaippu",
        "date": "Thursday, Nov 28, 9:15 AM",
        "description": "Groom Invitation",
        "content": "Mappillai (groom) Azhaippu (to invite) is a traditional welcome to the Chettiar groom and family prior to the wedding. The morning of the wedding, the groom along with his family arrive at the temple in the bride’s village. There they are received and welcomed by the bride’s family. The groom is then accompanied in a colorful procession, by foot or by horse, to the bride’s residence accompanied by nadaswaram (traditional music)."
    },
    {
        "id": "pen-edukki-kattuthal",
        "title": "Pen Edukki Kattuthal",
        "date": "Thursday, Nov 28, 10 AM",
        "description": "Bride Sighting",
        "content": "As the groom arrives at the residence of the bride, the bride’s aunt brings the bride for a playful “first” sighting. The bride is initially hidden with a mat and as the mat is lifted, the bride’s brother showers the groom with flowers. Back in the day, this was the bride and groom's first formal meeting or sighting."
    },
    {
        "id": "thirupootuthal",
        "title": "Thirupootuthal",
        "date": "Thursday, Nov 28, 10 AM",
        "description": "Tying of the Knot",
        "content": "After the bride changes into the Tiruputum saree, given by the mother of the groom, the bride and groom are brought to the manai by the mamakarangal. Throughout the wedding ceremony, the mamakarangal (maternal uncles) of the bride and groom play a significant role, they wear a special pink silk towel called mamakara pattu. The bride is given tampalam (betel leaf and betel nuts) with tamarind and a coconut to hold. The groom first applies tiruniru from the temple on himself and the bride and adorns the bride with the temple garland. The groom then ties the Kaluthiru with 3 knots, now the couple is officially married. Nadaswaram is played throughout the ceremony and reaches a crescendo when tying the thread. The Kaluthiru or the Chettiar wedding thali which is tied around the bride's neck carries a lot of significance. Kaluth stands for chain around the neck and Thiru stands for Goddess Lakshmi in Tamil. Chettinad thali has a total of 34 items that are specifically handcrafted by artisans and is a double piece of chain with pendants. There are two pendants that carry images of Gods. One is that of Goddess Lakshmi who is the Goddess of Wealth and Prosperity and another of Meenakshi (Goddess Parvati) and Sundareswarar (Lord Shiva) on top of the sacred bull called Rishaba. Both symbols play an important role in Chettinad weddings. It is believed that Goddess Lakshmi brings forth wealth while Lord Shiva and Parvati on top of the bull indicate a happy family. Guests give their blessings by sprinkling akshardam and flowers. The groom applies turmeric and kungumam (vermilion) to the thali and on the 3 knots. After that the garlands should be exchanged 3 times. Finally, the couple give sweets to each other."
    },
    {
        "id": "isaipidimanam",
        "title": "Isaipidimanam",
        "date": "Thursday, Nov 28, 11:30 AM",
        "description": "Formal Marriage Agreement",
        "content": "Back in the day, even before formal wedding registrations were in place, Chettiar weddings were registered with the temple. After the Thirupootuthal, the fathers of the bride and groom continue this tradition and register the wedding in the temple book."
    },
    {
        "id": "mamiyar-nathanar",
        "title": "Mamiyar and Nathanar Thiruputum Sadangu",
        "date": "Thursday, Nov 28, 11:30 AM",
        "description": "Mother-in-law and Sister-in-law Marriage Ritual",
        "content": "Following Thirupootuthal the mother and sister of the groom invite the bride into the family through this ritual. For Mamiyar (mother-in-law) Thiruputum Sadangu, the mother of the groom carries a silver plate with 7 items: silver Lord Ganesha, cotton, turmeric, tamarind, salt, betel nut, and raw rice. Each item is touched to her forehead and then to her new daughter-in-law 3 times. Each ingredient stands for a special blessing like prosperity, freshness, purification, fertility, soul connection, etc. The Nathanar (sister-in-law) Thiruputum Sadangu, is conducted similarly between the sister of the groom and her new sister-in-law."
    }
]
